AUTO_config_TK_pesok/src/InformationRegisters/ТК_КазначействоОчередьЭлектронныхПисем/ТК_КазначействоОчередьЭлектронныхПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТК_КазначействоОчередьЭлектронныхПисем</name>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлектронноеПисьмоВходящее</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/InformationRegisters/ТК_КазначействоОчередьЭлектронныхПисем/ManagerModule.bsl
Функция ПараметрыОтбораРегистра()
	
	ПоляОтбора = Новый Структура("Дата,ЭлектронноеПисьмоВходящее");
	
	Возврат ПоляОтбора;
	
КонецФункции

Функция СформироватьСтруктуруЗаписи() Экспорт
	СтруктураЗаписи = Новый Структура("Дата, ЭлектронноеПисьмоВходящее", ТекущаяДата(), "");
	Возврат СтруктураЗаписи;
КонецФункции



Функция НаборЗаписейРегистраПоПараметрамОтбора(ПараметрыОтбора)
	
	НаборЗаписей = РегистрыСведений.ТК_КазначействоОчередьЭлектронныхПисем.СоздатьНаборЗаписей();
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	
	Для Каждого ЭлементОтбора Из НаборЗаписей.Отбор Цикл
		ЗначениеОтбора = Неопределено;
		Если ПараметрыОтбора.Свойство(ЭлементОтбора.Имя, ЗначениеОтбора) Тогда
			ЭлементОтбора.Установить(ЗначениеОтбора);
		КонецЕсли;
	КонецЦикла;	
	
	Возврат НаборЗаписей;
	
КонецФункции

Процедура ЗаписатьОчередьЭлектронныхПисем(СтруктураЗаписи) Экспорт
	
	НаборЗаписей = РегистрыСведений.ТК_КазначействоОчередьЭлектронныхПисем.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Дата.Установить(СтруктураЗаписи.Дата);
	НаборЗаписей.Отбор.ЭлектронноеПисьмоВходящее.Установить(СтруктураЗаписи.ЭлектронноеПисьмоВходящее);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Запись = НаборЗаписей.Добавить();
	Иначе
		Запись = НаборЗаписей[0];
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Запись, СтруктураЗаписи);
	
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	НаборЗаписей.Записать();
	
КонецПроцедуры


Процедура ОчиститьОчередьЭлектронныхПисем(ПараметрыОтбора)
	
	НаборЗаписей = НаборЗаписейРегистраПоПараметрамОтбора(ПараметрыОтбора);
	НаборЗаписей.Записать();
	
КонецПроцедуры
